{"config": [{"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "name": "conv2d", "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 100, 100, 3], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "name": "conv2d_1", "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d", "dtype": "float32", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization", "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_constraint": null, "axis": [3], "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "name": "conv2d_2", "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "name": "conv2d_3", "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "dtype": "float32", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_1", "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_constraint": null, "axis": [3], "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "units": 128, "kernel_constraint": null, "bias_constraint": null, "name": "dense"}, "class_name": "Dense"}, {"config": {"seed": null, "trainable": true, "name": "dropout", "dtype": "float32", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_2", "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_constraint": null, "axis": [1], "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "softmax", "units": 52, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6-tf"}