{"backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 100, 100, 3], "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 32, "activation": "relu", "name": "conv2d", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 32, "activation": "relu", "name": "conv2d_1", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [3, 3], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d", "dtype": "float32", "padding": "valid", "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense", "units": 264, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_1", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "units": 95, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6-tf"}