{"backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d", "strides": [1, 1], "batch_input_shape": [null, 100, 100, 3], "data_format": "channels_last", "filters": 32, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "valid", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "data_format": "channels_last", "filters": 32, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [3, 3], "data_format": "channels_last", "dtype": "float32", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "name": "dropout", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense", "dtype": "float32", "activation": "relu", "bias_constraint": null, "trainable": true, "units": 264, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "dtype": "float32", "activation": "softmax", "bias_constraint": null, "trainable": true, "units": 95, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.1.6-tf", "class_name": "Sequential"}