{"backend": "tensorflow", "keras_version": "2.1.6-tf", "config": [{"config": {"padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_10", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 16, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 100, 100, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 16, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_11", "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "dtype": "float32", "pool_size": [4, 4], "name": "max_pooling2d_5", "strides": [4, 4], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "trainable": true, "name": "dropout_10", "rate": 0.25, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "name": "flatten_5", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "units": 264, "kernel_constraint": null, "name": "dense_10", "use_bias": true}, "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "name": "dropout_11", "rate": 0.5, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "units": 95, "kernel_constraint": null, "name": "dense_11", "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}