{"backend": "tensorflow", "keras_version": "2.1.6-tf", "config": [{"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "dilation_rate": [1, 1], "batch_input_shape": [null, 100, 100, 3], "name": "conv2d", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_1", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "name": "batch_normalization", "dtype": "float32", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_2", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_3", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "name": "batch_normalization_1", "dtype": "float32", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "flatten", "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "name": "dense", "units": 128}, "class_name": "Dense"}, {"config": {"seed": null, "dtype": "float32", "trainable": true, "name": "dropout", "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [1], "name": "batch_normalization_2", "dtype": "float32", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "softmax", "trainable": true, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "name": "dense_1", "units": 52}, "class_name": "Dense"}], "class_name": "Sequential"}