{"backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 100, 100, 3], "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 32, "activation": "relu", "name": "conv2d_2", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 32, "activation": "relu", "name": "conv2d_3", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "dtype": "float32", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"beta_constraint": null, "center": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "axis": [3], "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "name": "batch_normalization", "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 64, "activation": "relu", "name": "conv2d_4", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 64, "activation": "relu", "name": "conv2d_5", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "dtype": "float32", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"beta_constraint": null, "center": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "axis": [3], "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_1", "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_2", "units": 128, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_2", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"beta_constraint": null, "center": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "axis": [1], "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_2", "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_3", "units": 95, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6-tf"}