<<<<<<< HEAD
{"backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_10", "strides": [2, 2], "batch_input_shape": [null, 100, 100, 3], "data_format": "channels_last", "filters": 32, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_11", "strides": [1, 1], "data_format": "channels_last", "filters": 32, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_5", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "name": "batch_normalization_6", "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "scale": true, "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_12", "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_13", "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_6", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "name": "batch_normalization_7", "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "scale": true, "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_3", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_6", "dtype": "float32", "activation": "relu", "bias_constraint": null, "trainable": true, "units": 128, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_4", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [1], "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "name": "batch_normalization_8", "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "scale": true, "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_7", "dtype": "float32", "activation": "softmax", "bias_constraint": null, "trainable": true, "units": 95, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.1.6-tf", "class_name": "Sequential"}
=======
{"config": [{"config": {"filters": 32, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "name": "conv2d_12", "trainable": true, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 100, 100, 3], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "dtype": "float32", "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "name": "conv2d_13", "trainable": true, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_6", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "dtype": "float32", "center": true, "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "scale": true, "name": "batch_normalization_6", "momentum": 0.99, "trainable": true, "beta_constraint": null, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "dtype": "float32", "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "name": "conv2d_14", "trainable": true, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "dtype": "float32", "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "name": "conv2d_15", "trainable": true, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_7", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "dtype": "float32", "center": true, "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "scale": true, "name": "batch_normalization_7", "momentum": 0.99, "trainable": true, "beta_constraint": null, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 128, "bias_regularizer": null, "name": "dense_8", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "seed": null, "noise_shape": null, "dtype": "float32", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "dtype": "float32", "center": true, "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "scale": true, "name": "batch_normalization_8", "momentum": 0.99, "trainable": true, "beta_constraint": null, "axis": [1], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 95, "bias_regularizer": null, "name": "dense_9", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "softmax", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6-tf", "backend": "tensorflow"}
>>>>>>> e6dd6b95b8cb35195bb1aeadc7777faffd0938a9
