{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6-tf", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d", "activation": "relu", "data_format": "channels_last", "dtype": "float32", "batch_input_shape": [null, 100, 100, 3], "activity_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d", "padding": "valid", "pool_size": [2, 2], "dtype": "float32", "trainable": true, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization", "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3], "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "dtype": "float32", "trainable": true, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3], "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "data_format": "channels_last", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense", "activation": "relu", "trainable": true, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 128, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "noise_shape": null, "seed": null, "dtype": "float32", "rate": 0.5}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [1], "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "softmax", "trainable": true, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 95, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null}}]}