{"backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_10", "strides": [2, 2], "batch_input_shape": [null, 100, 100, 3], "data_format": "channels_last", "filters": 32, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_11", "strides": [1, 1], "data_format": "channels_last", "filters": 32, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_5", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "name": "batch_normalization_6", "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "scale": true, "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_12", "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_13", "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dtype": "float32", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_6", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "name": "batch_normalization_7", "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "scale": true, "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_3", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_6", "dtype": "float32", "activation": "relu", "bias_constraint": null, "trainable": true, "units": 128, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_4", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [1], "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "name": "batch_normalization_8", "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "scale": true, "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_7", "dtype": "float32", "activation": "softmax", "bias_constraint": null, "trainable": true, "units": 95, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.1.6-tf", "class_name": "Sequential"}