{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 100, 100, 3], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "padding": "same", "filters": 32, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv2d", "kernel_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_last", "use_bias": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "padding": "same", "filters": 32, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv2d_1", "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_last", "use_bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization", "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "padding": "same", "filters": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv2d_2", "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_last", "use_bias": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "padding": "same", "filters": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv2d_3", "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_last", "use_bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "units": 128, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense_4", "kernel_constraint": null, "dtype": "float32", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_4", "trainable": true, "rate": 0.5, "seed": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [1]}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "units": 11, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense_5", "kernel_constraint": null, "dtype": "float32", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "activation": "softmax"}}], "keras_version": "2.1.6-tf", "backend": "tensorflow"}